/*
Navicat MySQL Data Transfer

Source Server         : qnm
Source Server Version : 50621
Source Host           : 127.0.0.1:3306
Source Database       : bzct

Target Server Type    : MYSQL
Target Server Version : 50621
File Encoding         : 65001

Date: 2017-08-15 15:25:56
*/

SET FOREIGN_KEY_CHECKS=0;

-- ----------------------------
-- Table structure for bz_cart
-- ----------------------------
DROP TABLE IF EXISTS `bz_cart`;
CREATE TABLE `bz_cart` (
  `ctid` int(11) NOT NULL AUTO_INCREMENT,
  `userid` int(11) DEFAULT NULL,
  `did` int(11) DEFAULT NULL,
  `dishCount` int(11) DEFAULT NULL,
  PRIMARY KEY (`ctid`)
) ENGINE=InnoDB AUTO_INCREMENT=36 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of bz_cart
-- ----------------------------
INSERT INTO `bz_cart` VALUES ('32', '8', '19', '1');
INSERT INTO `bz_cart` VALUES ('33', '8', '16', '1');
INSERT INTO `bz_cart` VALUES ('34', '8', '4', '1');
INSERT INTO `bz_cart` VALUES ('35', '8', '13', '1');

-- ----------------------------
-- Table structure for bz_dish
-- ----------------------------
DROP TABLE IF EXISTS `bz_dish`;
CREATE TABLE `bz_dish` (
  `did` int(11) NOT NULL AUTO_INCREMENT,
  `name` varchar(64) DEFAULT NULL,
  `price` float(6,2) DEFAULT NULL,
  `img_sm` varchar(64) DEFAULT NULL,
  `img_lg` varchar(64) DEFAULT NULL,
  `detail` varchar(2048) DEFAULT NULL,
  `material` varchar(2048) DEFAULT NULL,
  `count` int(11) DEFAULT NULL,
  `star` varchar(10) DEFAULT NULL,
  `type` varchar(20) DEFAULT NULL,
  PRIMARY KEY (`did`)
) ENGINE=InnoDB AUTO_INCREMENT=35 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of bz_dish
-- ----------------------------
INSERT INTO `bz_dish` VALUES ('1', '酸甜开胃虾', '36.00', 'p0281.jpg', 'p0281-l.jpg', '话说有两个地方是我挪不动脚的，一个是图书馆，另外一个便是菜市场！ 每周有七天，留给自己的时间却很少。既要带儿子去上早教课，又要陪女儿上兴趣班，还要留一个半天带孩子们泡图书馆！ 有时真的觉得妈妈是这个世界上最伟大的职业，累，并快乐着！ 这个时节正是各类果蔬大量上市的时候，拖着买菜专用的小拉车，徜徉在人声鼎沸的菜市场，从海鲜区、肉类区再慢慢逛到我最喜爱的果蔬区，感受季节的变换带给人们餐桌上的喜悦………… ', '明虾、番茄酱、白糖、白醋、葱、姜、淀粉', '121', '5', '热菜');
INSERT INTO `bz_dish` VALUES ('2', '桂香紫薯山药卷', '16.50', 'p2679.jpg', 'p2679-l.jpg', '今天用紫薯，山药和吐司来做一款漂亮又健康的点心，做为早餐或者夜宵都是很好的选择哦！ 做法其实很简单，只要将各种食材层叠卷起来就行。提前煮好山药和紫薯，那么只要几分钟就能完成。 但就是这么一点小小的改变，就能立刻让原本平淡无奇的吐司变身抢手货哟~ 生活总是这样，时不时的有一些小惊喜，才会更加精彩不是嘛~', '切片吐司、紫薯、铁棍山药、糖桂花、炼乳', '123', '5', '热菜');
INSERT INTO `bz_dish` VALUES ('3', '小米椒爆炒小公鸡', '32.00', 'p8489.jpg', 'p8489-l.jpg', '算起来有一个星期没有更新了，忙着赶紧完成手头的工作，和孩子一起开启度假模式。我总是毫不避讳地称自己为吃货，对于我来说，度假中缺少美食是万万不可的。想要找一个风景与美食兼顾的度假地点可不太容易，工作之余忙着查路线，查攻略，总算是定好了目的地。其实我这个嗜辣族最想去的还是成都重庆一带，考虑到季节的原因，还是留到冬天再前往吧。今天上一道火辣辣的小米椒爆炒小公鸡，虽在家中，也是十足的过了把食辣的瘾，不擅吃辣的伙伴们做这道菜的时候可要记得减少辣椒的用量哦。', '三黄鸡、杭椒、干红椒、新鲜小米椒、麻椒、八角、香叶、葱、姜、生抽', '556', '4', '热菜');
INSERT INTO `bz_dish` VALUES ('4', '口袋饼', '6.50', 'p7818.jpg', 'p7818-l.jpg', '热水和面！面团擀成薄薄的面片之后切成长条，之后中间抹油！折叠之后用手把两边按扁，使其黏到一起！如图！然后用刀背划出花边！平底锅抹油小火煎制口袋饼，两边烙上金黄色即可！土豆切丝！黄瓜和香肠切条状！炒土豆丝，放入盐，醋和生抽炒均匀就可以了，然后放入烙好的口袋饼里，放入黄瓜和香肠即可！', '面粉、黄瓜、香肠、热水、土豆、盐、醋、生抽、油。', '451', '3', '主食');
INSERT INTO `bz_dish` VALUES ('5', '橄榄油版酸奶蛋糕', '32.00', 'p9138.jpg', 'p9138-l.jpg', '酸奶蛋糕，这是第二次做。自前一次做了带去单位分享后，吃到的同事都说好吃，连不爱甜食的自己也觉得细腻可口。特别是入冰箱后取出品味风味尤佳。喜欢那一丝丝的凉意一丝丝的甜味，入口的感觉特别绵软，很适合夏季食用的。这次还是没有用黄油，因为等融化嫌麻烦，继续用了橄榄油。不同的是这次用了水浴法烘焙的。我用的模具是八寸的活底蛋糕模具，成品有一点收腰，但口味还挺成功的。只是早上拍照心急得很，因为LG上班比较早。难得他如此喜欢吃了最大的两块。', '鸡蛋、玉米淀粉、绵白糖、白醋、低筋粉、橄榄油、酸奶。', '235', '4', '早餐');
INSERT INTO `bz_dish` VALUES ('6', '番茄肉酱意大利面', '25.00', 'p4788.jpg', 'p4788-l.jpg', '听说，台风天，电影和意大利面更配喔汤锅倒水烧开，放一勺盐一勺橄榄油，加入意面，煮13分钟。（意面种类不同，煮的时间也不一样，5-15分钟不等）。煮好的面控水，拌入一勺橄榄油，以防面粘连。平底锅倒油预热，蒜泥炒香，下肉糜翻炒至变色，倒入洋葱丁、番茄丁，翻炒一分钟，放番茄酱、盐、黑胡椒，继续翻炒。肉酱里加热水大火烧开，倒入意面转中火，待意面吸饱汤汁后，关火盛盘。', '意大利面、番茄、洋葱、蒜泥、肉糜、黑胡椒粉、番茄酱、盐', '685', '5', '主食');
INSERT INTO `bz_dish` VALUES ('7', '放心油条', '1.50', 'p7933.jpg', 'p7933-l.jpg', '自己炸的油条不含明矾，也不用担心地沟油，吃的比较放心。准备中筋粉，油条膨松剂和植物油。面粉和膨松剂混合均匀，加入50-60度温水搅拌。揉成光滑的面团，盖上保鲜膜醒30分钟左右。将醒发好的面团切成长形小剂子，两个叠在一起用筷子按压一下。用手捏住两头抻拉一下，放入7成热（约180-200度）的油锅中炸至金黄即可。', '面粉、安琪油条膨松剂、温水、植物油。', '457', '2', '早餐');
INSERT INTO `bz_dish` VALUES ('8', '蒸饺', '12.00', 'p6611.jpg', 'p6611-l.jpg', '昨天突然好想吃蒸饺，但是貌似没听过北京哪家蒸饺好吃，于是决定自己做啦，重要的事最近爱上做饭，能与大家分享美食乐趣也让我又燃起了烹饪的热情。想必最好吃的东西还是自己家的家常便饭！面粉300克，开水100ml左右（这个量可以在和面的时候自己调节下，蒸饺一定是烫面的）鸡蛋一个，我是用面包机和的面团，准备其他馅时一直在醒面（半小时内）。豆角酱肉馅：做法见我的豆角酱肉卤菜谱', '鸡蛋、豆角酱肉馅、西红柿鸡蛋馅、猪生抽、生抽、海鲜酱油、糖、盐', '124', '5', '主食');
INSERT INTO `bz_dish` VALUES ('9', '黯然销魂卤肉饭', '15.80', 'p003.jpg', 'p003-l.jpg', '地道的卤肉饭附上青菜，绿油油显得十分可爱。吃着卤肉饭就青菜和水波蛋，那股青菜的鲜香将口里的气味由油香与鲜甜升华至清爽，让你更痛快的把碗里的米饭一扫而空。', '五花肉、白饭、白糖、鸡蛋', '118', '4', '主食');
INSERT INTO `bz_dish` VALUES ('10', '蒜蓉辣酱拌茄子', '16.00', 'p004.jpg', 'p004-l.jpg', '茄子是一个非常多人喜欢的蔬菜食材，其做法相当的多。今天介绍的这个“蒜蓉酱拌茄子”就是其中之一，这菜可以说相当的不错。采用蒸与拌的手法来制作这个菜，“蒸”最大限度的保留了食材本身的味道与食材的营养价值。\r\n“拌”采用后期的调味混合使菜的味道得以提升，混合味使菜肴到达一个层次或多层次的味蕾味觉。夏天多吃点茄子是非常好的，特别是一些容易长痱子的小孩子。食用茄子能防治或治愈痱子，并且茄子的多种营养元素是人体必需的。', '长茄子、青葱、耗油、蒜头、鸡粉', '445', '5', '热菜');
INSERT INTO `bz_dish` VALUES ('11', '金蒜粉丝蒸西兰花', '15.00', 'p005.jpg', 'p005-l.jpg', '蒜香浓郁不辣口 低脂健康好味道 西兰花也可以吃的津津有味 粉丝吸足了汤汁 下饭好搭档', '西兰花、大蒜、几经、色拉油、指天椒', '111', '4', '热菜');
INSERT INTO `bz_dish` VALUES ('12', '糖醋排骨', '25.00', 'p006.jpg', 'p006-l.jpg', '一道从小就喜欢吃的菜菜！酸甜口夏天吃起来一定很开胃，汤汁浇饭更是好吃的起飞~~', '冰糖、肋排、醋、料酒、味精', '454', '5', '热菜');
INSERT INTO `bz_dish` VALUES ('13', '孜然牛肉', '28.00', 'p007.jpg', 'p007-l.jpg', '上大学的时候，我和室友们最喜欢吃的一道肉菜就是孜然牛肉，记忆中的孜然牛肉一定是加了蒜苔的，把蒜苔切小丁，放点小米椒或者干辣椒，出锅前撒上孜然，特别好吃的！学生时代的最爱，也是现在我经常会做给家人吃的一道家常菜。饭馆里的孜然牛肉通常是油炸捞出的，我做的这个爆炒家常做法', '牛肉、小米椒、蒜苔、姜、料酒、味极鲜', '345', '4', '热菜');
INSERT INTO `bz_dish` VALUES ('14', '素炒“蛔虫”面', '20.00', 'p008.jpg', 'p008-l.jpg', '《欢乐颂2》里面，王子文演的曲筱绡，王凯演的赵医生，在这一集里，曲筱绡和赵医生去吃蛔虫面。调皮的曲筱绡想恶心一下赵医生，故意说这面两头都是尖尖的，跟小时候长的蛔虫一样。自己津津有味的吃起来，想看赵医生出丑，不敢吃面。结果赵医生说这面里有揉面师傅们手心脱落的角质层。曲筱绡脸色大变，估计嘴里的都要吐出来了……\r\n周末在家，把手手洗干净，蛔虫面复刻起来，不会吃到手心脱落的角质层喽', '面粉、小白菜、小碗秋耳、橄榄油、鸡蛋、辣椒', '122', '4', '主食');
INSERT INTO `bz_dish` VALUES ('15', '牛骨响螺玉米汤', '18.00', 'p009.jpg', 'p009-l.jpg', '牛骨头中富含骨胶原蛋白，以及丰富的钙质，所以营养价值是很丰富的， 牛骨头汤中含有丰富的钙质，对小孩骨骼发育有好处。 牛骨髓中含有丰富磷脂和不饱和脂肪酸，能提高孩子的免疫力。', '牛尾骨、玉米、姜、响螺片、盐', '200', '5', '汤类');
INSERT INTO `bz_dish` VALUES ('16', '时蔬大骨汤', '19.00', 'p0010.jpg', 'p0010-l.jpg', '这天没有人想泡在厨房里挥汗如雨，教你炖出色白味美的大骨汤，只需简单的5步，就能营养美味一锅端。', '大棒骨、甜玉米、火腿片、西兰花、黑木耳、盐、糖', '120', '5', '汤类');
INSERT INTO `bz_dish` VALUES ('17', '鲫鱼萝卜汤', '22.00', 'p0011.jpg', 'p0011-l.jpg', '鲫鱼去腮、麟、内脏、及肚子里面的里膜；2. 锅烧热，先用生姜片涂锅为沾。再放入食用油煎鱼，待两面煎到微黄即可3. 白萝卜洗净去皮，切成丝备用；4. 煎好鲫鱼后，加入适量冷水，加葱、姜煮到沸腾。这时再加入萝卜丝；5. 盖上锅盖，大火煮开，再用中火煮30分钟左右；6. 出锅前加入盐、香菜调味。', '鲫鱼、生姜、白萝卜、油、盐、凉水', '312', '5', '汤类');
INSERT INTO `bz_dish` VALUES ('18', '木瓜银耳羹', '18.00', 'p0012.jpg', 'p0012-l.jpg', '春季适合养生 赶紧来上一碗木瓜银耳羹吧~', '银耳、冰糖、木瓜、枸杞', '89', '5', '汤类');
INSERT INTO `bz_dish` VALUES ('19', '番茄金针菇豆腐汤', '16.00', 'p0013.jpg', 'p0013-l.jpg', '番茄金针菇豆腐汤', '番茄、豆腐、金针菇', '78', '4', '汤类');
INSERT INTO `bz_dish` VALUES ('20', '清炖羊肉汤', '22.00', 'p0014.jpg', 'p0014-l.jpg', '北风呼啸而来的此时，正是吃上一碗清炖羊肉的最好时节。自古以来羊肉就是国人最为推崇的滋补食品之\r\n\r\n一，羊肉性温热可温胃御寒，尤其适合在秋冬食用。而且由于羊是纯食草动物，肉质非常的细嫩易消化，脂肪与\r\n\r\n胆固醇的含量也要比猪肉和牛肉少得多，是冬季具有进补和防寒双重效果的最佳美味。', '羊肉、料酒、姜、柑橘皮、盐、花椒、山楂', '88', '5', '汤类');
INSERT INTO `bz_dish` VALUES ('21', '紫菜虾皮汤', '12.00', 'p0015.jpg', 'p0015-l.jpg', '紫菜虾皮汤是我家餐桌上最常见的一道汤羹，虽然家里只有两口人，可每年要消耗三至四斤的虾皮和紫菜，可见我家有多么爱喝这道汤。\r\n　　紫菜虾皮汤虽然不起眼，但非常好喝，而且功效非常显著。现在全民都高叫着补钙，喝牛奶，吃钙片，其实虾皮素有“钙库”之称，钙质含量丰富，而且蛋白质含量也非常高。紫菜的热量很低，对于降血脂、胆固醇有一定的作用。有兴趣的朋友不妨试试这道经典的汤羹，长期坚持，效果甚佳哦', '紫菜、虾皮', '101', '4', '汤类');
INSERT INTO `bz_dish` VALUES ('22', '青菜豆腐羹', '14.00', 'p0016.jpg', 'p0016-l.jpg', '豆腐为补益清热养生食品，常食之，可补中益气、清热润燥、生津止渴、清洁肠胃。豆腐的最佳搭配:与海带搭配避免碘缺乏；与胡萝卜搭配避免消化不良。豆腐虽好，也不宜天天食用，过量食用却会危害健康。引起消化不良:豆腐含有丰富的蛋白质，一次食用过多不仅阻碍人体对铁的吸收', '小青菜、嫩豆腐、盐、香油、淀粉、小葱', '200', '5', '汤类');
INSERT INTO `bz_dish` VALUES ('23', '响油黄瓜', '14.00', 'p0017.jpg', 'p0017-l.jpg', '酷热的夏天，凉拌菜似乎更受大家的追捧。但拌来拌去，无非就是那几样。拍黄瓜就是我家夏季餐桌上的常客，省时省事的优点它都占了。但时间长了，也不免会口味疲劳。生活中很多时候，我们学会了换个角度看问题，其实我们也可以换个角度做菜。', '黄瓜、生抽、白糖、香油、姜', '125', '5', '冷菜');
INSERT INTO `bz_dish` VALUES ('24', '凉拌海带丝', '15.00', 'p0018.jpg', 'p0018-l.jpg', '海带性味微寒、无毒，具有软坚散结、消痰平喘、利水消肿、祛脂降压等功效。 现代医学研究证明，海带中含有许多有益于人体健康的营养成分和药用成分。食用海带可以降低血糖、血脂和胆固醇，可有效预防动脉硬化、便秘、癌症、老年性痴呆和抵抗衰老等。所以，日本人把海带称为“长寿菜”。', '海带、姜、葱、陈醋、生抽', '78', '4', '冷菜');
INSERT INTO `bz_dish` VALUES ('25', '凉拌土豆片', '12.00', 'p0019.jpg', 'p0019-l.jpg', '1、土豆是低热能、富含多维生素和微量元素的食物，具有和中养胃、健脾利湿、宽肠通便、补充营养、利水消肿、降糖降脂、美容养颜等功效，而且易被人体吸收。\r\n2、土豆在食用时最好将皮去掉，特别是凹陷部位和芽，要仔细清理干净，新鲜的小土豆处理干净后可以连皮食用。', '土豆、酱油、香油、花椒油、醋', '401', '5', '冷菜');
INSERT INTO `bz_dish` VALUES ('26', '洋葱拌黑木耳', '12.00', 'p0020.jpg', 'p0020-l.jpg', '黑木耳味甘性平，木耳中的胶质可把残留在人体消化系统内的灰尘杂质吸附集中起来排除体外，从而起到清胃肠的作用。洋葱俗葱头，在欧洲被誉为“菜中皇后”其营养成份丰富。味道很不错哦。', '黑木耳、香菜、葱、辣椒油、醋', '324', '5', '冷菜');
INSERT INTO `bz_dish` VALUES ('27', '香辣凉拌皮蛋', '13.00', 'p0021.jpg', 'p0021-l.jpg', '湘菜历史悠久，早在汉朝就已经形成菜系，烹调技艺已有相当高的水平。香辣皮蛋是湘菜中一道非常受欢迎的菜，而香辣皮蛋的做法却不是很难，简单弄两下，一道美味的家常菜即可上桌。', '松花皮蛋、辣椒油、大蒜、葱、芝麻香油', '156', '5', '冷菜');
INSERT INTO `bz_dish` VALUES ('28', '绝味泡椒凤爪', '15.00', 'p0022.jpg', 'p0022-l.jpg', '鸡爪味甘，性平；营养价值颇高，含有丰富的钙质及胶原蛋白，多吃不但能软化血管，同时具有美容功效。只要牙口好，中老年人也可以适量吃鸡爪，而且还可以多补些胶原蛋白，皮肤衰老的慢一些。', '凤爪、泡椒、料酒、花椒', '76', '4', '冷菜');
INSERT INTO `bz_dish` VALUES ('29', '凉拌手撕茄条', '12.00', 'p0023.jpg', 'p0023-l.jpg', '天气开始暖和起来，快手凉拌菜又要频繁出现在餐桌上啦(^_^)', '茄子、蒜、香菜、小葱、生抽、糖、油', '86', '4', '冷菜');
INSERT INTO `bz_dish` VALUES ('30', '山药牛奶', '15.00', 'p0024.jpg', 'p0024-l.jpg', '2016-06-21\r\n山药热量低，含有丰富的膳食纤维，能够润肠通便，还有美容养颜的作用，配上牛奶，能够补钙，有助于消除焦虑情绪。', '山药、牛奶、蜂蜜', '224', '5', '饮品');
INSERT INTO `bz_dish` VALUES ('31', '草莓奶昔', '16.00', 'p0025.jpg', 'p0025-l.jpg', '新入手的豆浆机当然要用到极致！午饭前将草莓洗净切成丁入冰箱冷冻，午休后开始制做草莓奶昔。500克草莓 220ml的牛奶2袋 2汤匙炼乳，将豆浆机设置到果汁档，开动，瞬间成功！三个人喝正好！连冰块都省了。', '草莓、牛奶、炼乳', '124', '5', '饮品');
INSERT INTO `bz_dish` VALUES ('32', '大米南瓜豆浆', '16.00', 'p0026.jpg', 'p0026-l.jpg', '【养生功效】：米汤能够刺激胃液的分泌，有利于消化，并对脂肪的吸收有促进作用。南瓜含有大量维生素、矿物质，能够增强肠胃蠕动力，南瓜含有的果胶能够保护胃肠道粘膜，使其避免受到粗糙食品的刺激，有促进溃疡面愈合的作用，适宜于胃部不适者。黄豆具有健脾宽中的作用，可以用于脾胃虚弱、消化不良等症。这款豆浆，大米、南瓜、黄豆共同作用，对养护脾胃很有帮助', '黄豆、大米、南瓜', '324', '5', '饮品');
INSERT INTO `bz_dish` VALUES ('33', '紫薯黑米糊', '16.00', 'p0027.jpg', 'p0027-l.jpg', '黑米又称为紫米、墨米，除了煮粥以外，还能用来做各种营养食品及酿酒。它对慢性患者、康复期患者及幼儿有较好的滋补作用，有利于儿童骨骼和大脑的发育，促进产妇、病后体弱者的康复。因此是一种理想的营养价值很高的保健食品。 黑米颜色之所以与其他米不同，主要是因为它外部的皮层中含花青素类色素。所含锰、锌等矿物质大都比大米高1~3倍，还含有大米所缺乏的维生素C、叶绿素、花青素、胡萝卜素及强心苷等特殊成分，因而黑米比普遍大米更具营养，是不可多得的滋补佳品。它富含蛋白质和氨基酸，还含有多种维生素、铁、硒等多种微量元素，其中硒还具有抗癌、防癌的功效。其次，黑米能明显提高人体血色素和血红蛋白的含量，有利于心血管系统的保健。经常食用黑米可黑发润肤，益寿延年。', '紫薯、砂糖、黑米', '89', '4', '饮品');
INSERT INTO `bz_dish` VALUES ('34', '红枣桂圆枸杞茶', '15.00', 'p0028.jpg', 'p0028-l.jpg', '红枣、桂圆、枸杞都是补血补气的佳品，红枣桂圆枸杞茶不仅滋补美颜，还有补血补气的作用，更能保护肝脏，增强造血功能，对人体健康是十分有益的。桂圆红枣茶加一点枸杞，能增加香甜味又有营养，现代科学证实枸杞对于保护肝脏、增强造血功能、提高免疫力、抗癌等都有帮助。红枣桂圆枸杞茶可以用锅煮着喝，也可以泡水喝，这次用豆浆机把所有材料加入，简单省事省时，还可以很好地吸收红枣桂圆枸杞的营养。', '桂圆肉、红枣、枸杞', '112', '5', '饮品');

-- ----------------------------
-- Table structure for bz_order
-- ----------------------------
DROP TABLE IF EXISTS `bz_order`;
CREATE TABLE `bz_order` (
  `oid` int(11) NOT NULL AUTO_INCREMENT,
  `userid` int(11) DEFAULT NULL,
  `phone` varchar(16) DEFAULT NULL,
  `user_name` varchar(16) DEFAULT NULL,
  `order_time` mediumtext,
  `addr` varchar(256) DEFAULT NULL,
  `totalprice` float(6,2) DEFAULT NULL,
  PRIMARY KEY (`oid`)
) ENGINE=InnoDB AUTO_INCREMENT=22 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of bz_order
-- ----------------------------
INSERT INTO `bz_order` VALUES ('21', '8', '18693061998', '强东', '1502687029000', '杭州市滨江区杭州二中白马湖学校', '42.00');

-- ----------------------------
-- Table structure for bz_orderdetails
-- ----------------------------
DROP TABLE IF EXISTS `bz_orderdetails`;
CREATE TABLE `bz_orderdetails` (
  `oid` int(11) DEFAULT NULL,
  `did` int(11) DEFAULT NULL,
  `dishCount` int(11) DEFAULT NULL,
  `price` float(8,2) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of bz_orderdetails
-- ----------------------------
INSERT INTO `bz_orderdetails` VALUES ('21', '33', '1', '16.00');
INSERT INTO `bz_orderdetails` VALUES ('21', '18', '1', '18.00');

-- ----------------------------
-- Table structure for users
-- ----------------------------
DROP TABLE IF EXISTS `users`;
CREATE TABLE `users` (
  `userid` int(11) NOT NULL AUTO_INCREMENT,
  `uname` varchar(20) DEFAULT NULL,
  `pwd` varchar(20) DEFAULT NULL,
  `addr` varchar(50) DEFAULT NULL,
  `phone` varchar(50) DEFAULT NULL,
  PRIMARY KEY (`userid`)
) ENGINE=InnoDB AUTO_INCREMENT=16 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of users
-- ----------------------------
INSERT INTO `users` VALUES ('8', '强东', '123', 'null', '18693061998');
INSERT INTO `users` VALUES ('14', 'wangnima', '123', 'null', '123');
INSERT INTO `users` VALUES ('15', 'jfdjfdf', '123', 'null', '132132');
